html/kotlin/collections/map.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Map</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./set.html"> UP </a>
 |
 <a accesskey="H" href="./collections.html"> HOME </a>
</div><div id="content">
<h1 class="title">Map</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4cd730d">取键与值</a></li>
<li><a href="#orgbbf2520">过滤</a></li>
<li><a href="#org90392af">加减操作</a></li>
<li><a href="#org3d6a284">Map 写操作</a>
<ul>
<li><a href="#org2be04a0">添加与更新条目</a></li>
<li><a href="#orgfcc8486">删除条目</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
在 map 中，键和值的类型都是用户定义的。 对基于键的访问启用了各种特定于 map 的处理函数，从键获取值到对键和值进行单独过滤
</p>
<div id="outline-container-org4cd730d" class="outline-2">
<h2 id="org4cd730d">取键与值</h2>
<div class="outline-text-2" id="text-org4cd730d">
<ul class="org-ul">
<li>要从 Map 中检索值，必须提供其键作为 <span class="underline">get()</span> 函数的参数。 还支持简写 <span class="underline">[key]</span> 语法。 如果找不到给定的键，则返回 <span class="underline">null</span></li>
<li>函数 <span class="underline">getValue()</span> ，它的行为略有不同：如果在 Map 中找不到键，则 <b>抛出</b> <span class="underline">异常</span></li>
</ul>

<p>
此外，还有两个选项可以解决键缺失的问题：
</p>
<ul class="org-ul">
<li><span class="underline">getOrElse()</span> 与 list 的工作方式相同：对于不存在的键，其值由给定的 lambda 表达式返回</li>
<li><span class="underline">getOrDefault()</span> 如果找不到键，则返回指定的默认值</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3)
    println(numbersMap.<span style="color: #00bfff; font-weight: bold;">get</span>(<span style="color: #deb887;">"one"</span>))
    println(numbersMap[<span style="color: #deb887;">"one"</span>])
    println(numbersMap.getOrDefault(<span style="color: #deb887;">"four"</span>, 10))
    println(numbersMap[<span style="color: #deb887;">"five"</span>])               <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">null</span>
    <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">numbersMap.getValue("six")      // exception!</span>
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
要对 map 的所有键或所有值执行操作，可以从属性 <span class="underline">keys</span> 和 <span class="underline">values</span> 中相应地检索它们：
</p>
<ul class="org-ul">
<li>keys 是 Map 中所有键的集合</li>
<li>values 是 Map 中所有值的集合</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3)
    println(numbersMap.keys)
    println(numbersMap.values)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbbf2520" class="outline-2">
<h2 id="orgbbf2520">过滤</h2>
<div class="outline-text-2" id="text-orgbbf2520">
<p>
可以使用 <span class="underline">filter()</span> 函数来过滤 map 或其他集合。 对 map 使用 filter() 函数时， <span class="underline">Pair</span> 将作为参数的谓词传递给它。 它将使用谓词同时过滤其中的键和值：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mapOf(<span style="color: #deb887;">"key1"</span> to 1, <span style="color: #deb887;">"key2"</span> to 2, <span style="color: #deb887;">"key3"</span> to 3, <span style="color: #deb887;">"key11"</span> to 11)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">filteredMap</span> = numbersMap.filter { (key, value) -&gt; key.endsWith(<span style="color: #deb887;">"1"</span>) &amp;&amp; value &gt; 10}
    println(filteredMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
还有两种用于过滤 map 的特定函数：按键或按值。对应的函数： <span class="underline">filterKeys()</span> 和 <span class="underline">filterValues()</span> ，两者都将返回一个新 Map ，其中包含与给定谓词相匹配的条目：
</p>
<ul class="org-ul">
<li>filterKeys() 的谓词仅检查元素键</li>
<li>filterValues() 的谓词仅检查值</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mapOf(<span style="color: #deb887;">"key1"</span> to 1, <span style="color: #deb887;">"key2"</span> to 2, <span style="color: #deb887;">"key3"</span> to 3, <span style="color: #deb887;">"key11"</span> to 11)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">filteredKeysMap</span> = numbersMap.filterKeys { <span style="color: #00bfff; font-weight: bold;">it</span>.endsWith(<span style="color: #deb887;">"1"</span>) }
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">filteredValuesMap</span> = numbersMap.filterValues { <span style="color: #00bfff; font-weight: bold;">it</span> &lt; 10 }

    println(filteredKeysMap)
    println(filteredValuesMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org90392af" class="outline-2">
<h2 id="org90392af">加减操作</h2>
<div class="outline-text-2" id="text-org90392af">
<p>
由于需要访问元素的键，plus <span class="underline">+</span> 与 minus <span class="underline">-</span> 运算符对 map 的作用与其他集合不同。 plus 返回包含两个操作数元素的 Map ：
</p>
<ul class="org-ul">
<li>左侧 Map</li>
<li>右侧 Pair 或另一个 Map 
<ul class="org-ul">
<li>当右侧操作数中有左侧 Map 中已存在的键时，该条目将使用右侧的值</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3)
    println(numbersMap + <span style="color: #98f5ff;">Pair</span>(<span style="color: #deb887;">"four"</span>, 4))
    println(numbersMap + <span style="color: #98f5ff;">Pair</span>(<span style="color: #deb887;">"one"</span>, 10))
    println(numbersMap + mapOf(<span style="color: #deb887;">"five"</span> to 5, <span style="color: #deb887;">"one"</span> to 11))
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>


<p>
minus 将根据左侧 Map 条目创建一个新 Map ，右侧操作数带有键的条目将被剔除
</p>
<ul class="org-ul">
<li>右侧操作数可以是单个键或键的集合： list 、 set 等</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3)
    println(numbersMap - <span style="color: #deb887;">"one"</span>)
    println(numbersMap - listOf(<span style="color: #deb887;">"two"</span>, <span style="color: #deb887;">"four"</span>))
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<pre class="example">
    可变 Map 中使用 plusAssign (+=) 与 minusAssign (-=) 运算符
</pre>
</div>
</div>
<div id="outline-container-org3d6a284" class="outline-2">
<h2 id="org3d6a284">Map 写操作</h2>
<div class="outline-text-2" id="text-org3d6a284">
<p>
Mutable Map （可变 Map ）提供特定的 Map 写操作。 这些操作可以使用键来访问或更改 Map 值。Map 写操作的一些规则：
</p>
<ul class="org-ul">
<li>值可以更新。反过来，键也永远不会改变：添加条目后，键是不变的</li>
<li>每个键都有一个与之关联的值。也可以添加和删除整个条目</li>
</ul>
</div>

<div id="outline-container-org2be04a0" class="outline-3">
<h3 id="org2be04a0">添加与更新条目</h3>
<div class="outline-text-3" id="text-org2be04a0">
<p>
要将新的键值对添加到可变 Map ，请使用 <span class="underline">put()</span>  
</p>

<pre class="example">
     新条目会被放入 LinkedHashMap （Map的默认实现）后，会添加该条目，以便在 Map 迭代时排在最后

     在 Map 类中，新元素的位置由其键顺序定义
</pre>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mutableMapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2)
    numbersMap.put(<span style="color: #deb887;">"three"</span>, 3)
    println(numbersMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
要一次添加多个条目，请使用 <span class="underline">putAll()</span> 。它的参数可以是 Map 或一组 Pair ： Iterable 、 Sequence 或 Array  
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mutableMapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3)
    numbersMap.putAll(setOf(<span style="color: #deb887;">"four"</span> to 4, <span style="color: #deb887;">"five"</span> to 5))
    println(numbersMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
如果给定键已存在于 Map 中，则 put() 与 putAll() 都将覆盖值。 因此，可以使用它们来 <span class="underline">更新</span> Map 条目的值 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mutableMapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">previousValue</span> = numbersMap.put(<span style="color: #deb887;">"one"</span>, 11)
    println(<span style="color: #deb887;">"value associated with 'one', before: </span><span style="color: #4eee94;">$previousValue</span><span style="color: #deb887;">, after: ${</span>numbersMap[<span style="color: #deb887;">"one"</span>]<span style="color: #deb887;">}"</span>)
    println(numbersMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
还可以使用快速操作符将新条目添加到 Map 。 有两种方式：
</p>
<ul class="org-ul">
<li>plusAssign <span class="underline">+=</span>  操作符</li>
<li><span class="underline">[]</span> 操作符为 put() 的别名</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mutableMapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2)
    numbersMap[<span style="color: #deb887;">"three"</span>] = 3     <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#35843;&#29992; numbersMap.put("three", 3)</span>
    numbersMap += mapOf(<span style="color: #deb887;">"four"</span> to 4, <span style="color: #deb887;">"five"</span> to 5)
    println(numbersMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
使用 Map 中存在的键进行操作时，将覆盖相应条目的值
</p>
</div>
</div>

<div id="outline-container-orgfcc8486" class="outline-3">
<h3 id="orgfcc8486">删除条目</h3>
<div class="outline-text-3" id="text-orgfcc8486">
<p>
要从可变 Map 中删除条目，请使用 <span class="underline">remove()</span> 函数。 调用 remove() 时，可以传递键或整个键值对。 如果同时指定键和值，则仅当键值都匹配时，才会删除此的元素 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mutableMapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3)
    numbersMap.remove(<span style="color: #deb887;">"one"</span>)
    println(numbersMap)
    numbersMap.remove(<span style="color: #deb887;">"three"</span>, 4)            <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">&#19981;&#20250;&#21024;&#38500;&#20219;&#20309;&#26465;&#30446;</span>
    println(numbersMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<p>
还可以通过键或值从可变 Map 中删除条目。 在 Map 的 <span class="underline">.keys</span> 或 <span class="underline">.values</span> 中调用 remove() 并提供键或值来删除条目
</p>
<ul class="org-ul">
<li>在 <span class="underline">.values</span> 中调用时， remove() 仅删除给定值匹配到的的 <b>第一个</b> 条目</li>
</ul>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mutableMapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3, <span style="color: #deb887;">"threeAgain"</span> to 3)
    numbersMap.keys.remove(<span style="color: #deb887;">"one"</span>)
    println(numbersMap)
    numbersMap.values.remove(3)
    println(numbersMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>


<p>
minusAssign <span class="underline">-=</span> 操作符也可用于可变 Map 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">numbersMap</span> = mutableMapOf(<span style="color: #deb887;">"one"</span> to 1, <span style="color: #deb887;">"two"</span> to 2, <span style="color: #deb887;">"three"</span> to 3)
    numbersMap -= <span style="color: #deb887;">"two"</span>
    println(numbersMap)
    numbersMap -= <span style="color: #deb887;">"five"</span>             <span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">&#19981;&#20250;&#21024;&#38500;&#20219;&#20309;&#26465;&#30446;</span>
    println(numbersMap)
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>
}
</pre>
</div>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="set.html">Previous: Set</a></td>
<td class="org-left"><a href="collections.html">Home：集合</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
